Revit 2024 API
BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChain Property
 A formula in a global parameter causes a circular chain of references between highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GlobalParamFormulaCircularChain { get; }
Visual Basic
Public Shared ReadOnly Property GlobalParamFormulaCircularChain As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GlobalParamFormulaCircularChain {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace